#ifndef SEQQUEUE_H
#define SEQQUEUE_H

#define 	MAXSIZE		50  // 队列的最大长度

typedef char SeqQueueElementType;

typedef struct SeqQueueNode 
{
	SeqQueueElementType 	element[MAXSIZE];  // 队列的元素空间
	int						front;             // 头指针指示器
	int						rear;              // 尾指针指示器
}SeqQueue;

/***************************************************************************** 
 *                    顺序队列初始化                                         * 
 *****************************************************************************/ 
void InitialSeqQueue(SeqQueue * Q);

/***************************************************************************** 
 *                    顺序队列入队操作                                       * 
 *****************************************************************************/ 
int EnterSeqQueue(SeqQueue * Q, SeqQueueElementType x);

/***************************************************************************** 
 *                    顺序队列出队操作                                       * 
 *****************************************************************************/ 
int DeleteSeqQueue(SeqQueue * Q, SeqQueueElementType * x);

/***************************************************************************** 
 *                    取出顺序队列的对头元素                                 * 
 *****************************************************************************/ 
int GetSeqQueueHead(SeqQueue * Q, SeqQueueElementType * x);

/***************************************************************************** 
 *                    判断顺序队列是否为空                                   * 
 *****************************************************************************/ 
int IsSeqQueueEmpty(SeqQueue * Q);

#endif // END SEQQUEUE_H
